БухЭксп/InformationRegisters/ОрганизацииБизнесСеть.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.20">
	<InformationRegister>
		<Properties>
			<Name>ОрганизацииБизнесСеть</Name>
			<Comment>Зарегистрированные организации в сервисе 1С:Бизнес-сеть</Comment>
			<InformationRegisterPeriodicity>Nonperiodical</InformationRegisterPeriodicity>
			<WriteMode>Independent</WriteMode>
		</Properties>
		<ChildObjects>
			<Resource>
				<Properties>
					<Name>Идентификатор</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>36</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Attribute>
				<Properties>
					<Name>ТребуетсяПовторноеПодключение</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ИНН</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>12</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>КПП</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>9</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Dimension>
				<Properties>
					<Name>Организация</Name>
					<Type>
						<v8:TypeSet>cfg:DefinedType.Организация</v8:TypeSet>
					</Type>
				</Properties>
			</Dimension>
		</ChildObjects>
	</InformationRegister>
</MetaDataObject>

БухЭксп/InformationRegisters/ОрганизацииБизнесСеть/Ext/ManagerModule.bsl
// @strict-types

#Если Сервер Или ТолстыйКлиентОбычноеПриложение Или ВнешнееСоединение Тогда

#Область СлужебныйПрограммныйИнтерфейс

// См. БизнесСеть.АктуализироватьИдентификаторыОрганизацийКонтрагентов
Процедура Актуализировать() Экспорт

	УстановитьПривилегированныйРежим(Истина);
	
	Запрос = НовыйПодключенныеОрганизации();
	ТаблицаПоиска = БизнесСетьСлужебный.НоваяТаблицаПоиска();
	Организация = Неопределено;
	
	Пока Истина Цикл
		
		Запрос.УстановитьПараметр("Организация", Организация);
		РезультатЗапроса = Запрос.Выполнить();
		
		Если РезультатЗапроса.Пустой() Тогда
			Прервать;
		КонецЕсли;
		
		ВыборкаЗапроса = РезультатЗапроса.Выбрать();
		
		Пока ВыборкаЗапроса.Следующий() Цикл
			
			//@skip-check property-return-type - Особенность строгой типизации
			Организация = ВыборкаЗапроса.Организация; // ОпределяемыйТип.ОрганизацияКонтрагентEDI
			//@skip-check property-return-type - Особенность строгой типизации
			ИНН = ВыборкаЗапроса.ИНН; // Строка
			//@skip-check property-return-type - Особенность строгой типизации
			КПП = ВыборкаЗапроса.КПП; // Строка
			
			// Нормализуем значение, полученные из прикладных данных
			ИНН = СокрЛП(ИНН);
			КПП = СокрЛП(КПП);
			
			Если Не БизнесСетьСлужебный.ЭтоИННКПП(ИНН, КПП) Тогда
				Продолжить;
			КонецЕсли;
			
			НоваяСтрока = ТаблицаПоиска.Добавить();
			НоваяСтрока.Ссылка = Организация;
			НоваяСтрока.ИНН = ИНН;
			НоваяСтрока.КПП = КПП;
			НоваяСтрока.Закеширован = Истина;
			
		КонецЦикла;
		
	КонецЦикла;
	
	БизнесСетьСлужебный.ВыполнитьПоискКонтрагентов(ТаблицаПоиска);
	
	Записать(ТаблицаПоиска);
	
КонецПроцедуры

#КонецОбласти

#Область СлужебныеПроцедурыИФункции

// Новый запрос контрагенты для кэширования.
// 
// Возвращаемое значение:
//  Запрос - Запрос контрагентов, требующих актуализации
Функция НовыйПодключенныеОрганизации()
	
	Запрос = Новый Запрос;
	ТекстЗапроса = 
		"ВЫБРАТЬ ПЕРВЫЕ 1000
		|	Организации.Ссылка КАК Организация,
		|	&ПутьОрганизацияИНН КАК ИНН,
		|	&ПутьОрганизацияКПП КАК КПП
		|ИЗ
		|	&ТаблицаОрганизации КАК Организации
		|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ РегистрСведений.ОрганизацииБизнесСеть КАК ОрганизацииБизнесСеть
		|		ПО Организации.Ссылка = ОрганизацииБизнесСеть.Организация
		|ГДЕ
		|	Организации.Ссылка > &Организация
		|	И (ОрганизацииБизнесСеть.ИНН <> ВЫРАЗИТЬ(&ПутьОрганизацияИНН КАК СТРОКА(12))
		|		ИЛИ ОрганизацииБизнесСеть.КПП <> ВЫРАЗИТЬ(&ПутьОрганизацияКПП КАК СТРОКА(9)))
		|
		|УПОРЯДОЧИТЬ ПО
		|	Организация";
	
	ИмяСправочникаОрганизации = ОбщегоНазначенияБЭД.ИмяПрикладногоСправочника("Организации"); // Строка
	РеквизитИНН = ОбщегоНазначенияБЭДПовтИсп.ИмяНаличиеОбъектаРеквизитаВПрикладномРешении("ИННОрганизации");
	РеквизитКПП = ОбщегоНазначенияБЭДПовтИсп.ИмяНаличиеОбъектаРеквизитаВПрикладномРешении("КППОрганизации");
	
	ТекстЗапроса = СтрЗаменить(ТекстЗапроса, "&ТаблицаОрганизации", "Справочник." + ИмяСправочникаОрганизации);
	ТекстЗапроса = СтрЗаменить(ТекстЗапроса, "&ПутьОрганизацияИНН", "Организации." + РеквизитИНН);
	ТекстЗапроса = СтрЗаменить(ТекстЗапроса, "&ПутьОрганизацияКПП", "Организации." + РеквизитКПП);

	Запрос.Текст = ТекстЗапроса;
	
	Возврат Запрос;
	
КонецФункции

// Фиксирует информацию об изменении идентификатора или регистрационных сведений организации в регистр
// 
// Параметры:
//  ТаблицаПоиска - См. БизнесСетьСлужебный.НоваяТаблицаПоиска
Процедура Записать(Знач ТаблицаПоиска)
	
	Если ТаблицаПоиска.Количество() = 0 Тогда
		Возврат; 
	КонецЕсли;
	
	Порции = БизнесСетьСлужебный.РазбитьТаблицуНаПорции(
		ТаблицаПоиска, 1000); // Массив Из См. БизнесСетьСлужебный.НоваяТаблицаПоиска
	
	ИзмененныеОрганизации = БизнесСетьСлужебный.НовыеИзмененныеОрганизации();
	
	// Добавление и изменение записей кеша
	Для Каждого Порция Из Порции Цикл
		НачатьТранзакцию();
		Попытка
			УстановитьБлокировку(Порция);
			
			Для Каждого Строка Из Порция Цикл
				НаборЗаписей = СоздатьНаборЗаписей();
				НаборЗаписей.Отбор.Организация.Установить(Строка.Ссылка);
				
				НаборЗаписей.Прочитать();
				
				Если НаборЗаписей.Количество() = 0 Тогда
					Продолжить; // Организация была отключена в другом сеансе
				ИначеЕсли НаборЗаписей.Количество() = 1 Тогда
					Запись = НаборЗаписей[0];
					
					Если Не Строка.Найден Тогда
						// Для организации были изменены регистрационные данные, по новым данным организация 
						// не зарегистрирована:
						//  - Оповещаем другие механизмы через подписки
						//  - Удаляем сведения об организации
						//  - Очищаем токен выданный для старого идентификаора
						НоваяСтрока = ИзмененныеОрганизации.Добавить();
						
						НоваяСтрока.Организация = Строка.Ссылка;
						НоваяСтрока.СтарыйИдентификатор = Запись.Идентификатор;
						НоваяСтрока.СтарыйИНН           = Запись.ИНН;
						НоваяСтрока.СтарыйКПП           = Запись.КПП;
						
						НаборЗаписей.Очистить();
						БизнесСеть.УдалитьКлючДоступаИзЛокальногоХранилища(Запись.Идентификатор);
					ИначеЕсли Запись.Идентификатор <> Строка.Идентификатор Тогда
						// Для организации были изменены регистрационные данные:
						//  - Оповещаем другие механизмы через подписки
						//  - Отмечаем организацию, как требующую переподключения
						//  - Очищаем токен выданный для старого идентификаора
						//  - Заполняем сведения по данным сервиса 1С:Бизнес-сеть
						НоваяСтрока = ИзмененныеОрганизации.Добавить();
						
						НоваяСтрока.Организация = Строка.Ссылка;
						НоваяСтрока.НовыйИдентификатор  = Строка.Идентификатор;
						НоваяСтрока.НовыйИНН            = Строка.ИНН;
						НоваяСтрока.НовыйКПП            = Строка.КПП;
						НоваяСтрока.СтарыйИдентификатор = Запись.Идентификатор;
						НоваяСтрока.СтарыйИНН           = Запись.ИНН;
						НоваяСтрока.СтарыйКПП           = Запись.КПП;
						
						Запись.ТребуетсяПовторноеПодключение = Истина;
						БизнесСеть.УдалитьКлючДоступаИзЛокальногоХранилища(Запись.Идентификатор);
						
						Запись.Идентификатор = Строка.Идентификатор;
						Запись.ИНН           = Строка.ИНН;
						Запись.КПП           = Строка.КПП;
						
					Иначе
						Запись.ИНН = Строка.ИНН;
						Запись.КПП = Строка.КПП;
					КонецЕсли;
					
				Иначе
					ВызватьИсключение(
						СтрШаблон(
							НСтр(
								"ru = 'Ошибка уникальностей записи регистра Организации 1С:Бизнес-сеть по организации %1'",
								ОбщегоНазначения.КодОсновногоЯзыка()),
							Строка.Ссылка));
				КонецЕсли;
				
				НаборЗаписей.Записать(Истина);
			КонецЦикла;
			
			ЗафиксироватьТранзакцию();
		Исключение
			ОтменитьТранзакцию();
			ВызватьИсключение;
		КонецПопытки;
	КонецЦикла;
	
	БизнесСетьСлужебный.ПриИзмененииИдентификаторовОрганизаций(ИзмененныеОрганизации);
	
КонецПроцедуры

// Устанавливает исключительную блокировку таблицы для записи
// 
// Параметры:
//  ТаблицаПоиска - См. БизнесСетьСлужебный.НоваяТаблицаПоиска
Процедура УстановитьБлокировку(Знач ТаблицаПоиска)
	
	Контекст = "РегистрыСведений.ОрганизацииБизнесСеть.УстановитьБлокировку";
	
	ОбщегоНазначенияКлиентСервер.Проверить(
		ТранзакцияАктивна(),
		НСтр(
			"ru = 'Вызов метода вне тракнзации не допускается'",
			ОбщегоНазначения.КодОсновногоЯзыка()),
		Контекст);
	
	Блокировка = Новый БлокировкаДанных;
	
	ЭлементБлокировки = Блокировка.Добавить(Метаданные.РегистрыСведений.ОрганизацииБизнесСеть.ПолноеИмя());
	ЭлементБлокировки.Режим = РежимБлокировкиДанных.Исключительный;
	ЭлементБлокировки.ИсточникДанных = ТаблицаПоиска;
	ЭлементБлокировки.ИспользоватьИзИсточникаДанных("Организация", "Ссылка");

	//@skip-check lock-out-of-try
	Блокировка.Заблокировать();
	
КонецПроцедуры

#КонецОбласти

#КонецЕсли
